{
  "app": "executor",
  "version": "0.0.1",
  "category": "algart.matrices.objects",
  "name": "Sequentially reindex labels",
  "description": "Finds all different labels in the source integer matrix and reindex them, so that the minimal existing label will be replaced with K, the next label (in increasing order) will become K+1, the next one will be translated to K+2, ..., where the base K is specified by \"Indexing base of labels\" parameter.",
  "id": "08cc2547-1c1c-483e-80cb-36b69417a3b5",
  "language": "java",
  "java": {
    "class": "net.algart.executors.modules.cv.matrices.objects.ReindexLabels"
  },
  "tags": [
    "java",
    "images",
    "express"
  ],
  "in_ports": [
    {
      "value_type": "mat",
      "name": "labels"
    }
  ],
  "out_ports": [
    {
      "value_type": "mat",
      "name": "labels",
      "hint": "Translated (reindexed) source labels."
    },
    {
      "value_type": "numbers",
      "caption": "sequential restoring table",
      "name": "restoring_table",
      "hint": "For every value V in the returned matrix, the original label before reindexing will be equal to\ntable[V−1] or table[V], depending on \"Include reserved labels in restoring table\" flag."
    }
  ],
  "controls": [
    {
      "caption": "Indexing base of labels",
      "name": "indexingBase",
      "description": "Note that this mode really affects the resuls only when the source matrix does not contain zero elements. If it contains at least one zero element, results will be the same both with 0 and 1 indexing bases. If the source matrix DOES NOT contain zeros, indexing base = 0 will lead to building result labels 0,1,2,... (so, the result WILL contain zeros), but indexing base = 0 will lead to building result labels 1,2,3,... without zeros.",
      "value_type": "String",
      "edition_type": "enum",
      "items": [
        {
          "value": "ZERO_BASED",
          "caption": "0 (zero-based numbering)"
        },
        {
          "value": "ONE_BASED",
          "caption": "1 (one-based numbering)"
        }
      ],
      "default": "ONE_BASED"
    },
    {
      "caption": "Include reserved labels in restoring table",
      "name": "includeReservedInRestoringTable",
      "description": "If set and if the indexing base K is non-zero (1), then the returned \"sequential restoring table\" will also contain first K elements, corresponding K reserved label values: 0,1,...,K−1. (In current version, the only allowed non-zero value is K=1, so only one element 0 is included into the table.) Thus, the original label before reindexing for the given result value V will be table[V].\nIf this flag is cleared, first K elements are NOT included into the \"sequential restoring table\", so, the original label will be restored as table[V−K].",
      "value_type": "boolean",
      "edition_type": "value",
      "default": false
    }
  ]
}